title: proc_creation_win_office_lolbin
status: stable
description: Detects LOLBINS running as child process of MS Office applications.
author: Justin Lentz
tags:
 - attack.execution
 - attack.t1204.002
date: 2022/06/29
level: critical
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:  
      - '\WINWORD.EXE'
      - '\EXCEL.EXE'
      - '\POWERPNT.exe'
      - '\MSPUB.exe'
      - '\VISIO.exe'
      - '\OUTLOOK.EXE'
      - '\MSACCESS.EXE'
      - '\EQNEDT32.EXE'
	Image|endswith:
	  - '\rundll32.exe'
      - '\cmd.exe'
      - '\powershell.exe'
      - '\pwsh.exe'
      - '\schtasks.exe'
      - '\regsvr32.exe'
      - '\mshta.exe'
      - '\taskhostw.exe'
      - '\forfiles.exe'
      - '\cscript.exe'
      - '\wscript.exe'
      - '\wmic.exe'
	  - '\msiexec.exe'
	  - '\hh.exe'
	  - '\msdt.exe'
	  - '\sh.exe'
	  - '\bash.exe'
	  - '\scrcons.exe'
	  - '\scriptrunner.exe'
	  - '\mftrace.exe'
	  - '\AppVLP.exe'
	  - '\msbuild.exe'
	  - '\verclsid.exe'
	  - '\svchost.exe'
    filter_false_positives:
	  Commandline|contains:
	  - '{90150000-0012-0000-0000-0000000FF1CE}'
      - 'shell32.dll,Control_RunDLL "srchadmin.dll'
	condition: selection and not filter_false_positives
falsepositives:
  - unknown